#### Terraform Plan 📖 `modules/test`

<details><summary>Clique aqui para ver o Plan completo</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test_bucket will be created
  + resource "google_storage_bucket" "test_bucket" {
      + effective_labels            = {
          + "approved"                   = "true"
          + "env"                        = "lab"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "analice"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "approved" = "true"
          + "env"      = "lab"
          + "owner"    = "analice"
        }
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "approved"                   = "true"
          + "env"                        = "lab"
          + "goog-terraform-provisioned" = "true"
          + "owner"                      = "analice"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # random_id.suffix will be created
  + resource "random_id" "suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AnaliceMBattisti, Action: `pull_request`*